Revit 2027 API
WorksetTable.GetWorkset(Guid) Method
 Returns the workset from a input Guid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Workset GetWorkset(
	Guid guid
)
Public Function GetWorkset (
	guid As Guid
) As Workset
public:
Workset^ GetWorkset(
	Guid guid
)
member GetWorkset :
        guid : Guid -> Workset
Parameters
guid Guid
 Guid of the workset.
Return Value
Workset
 The returned workset. null if there is no workset in this table with this Id.
See Also
Reference
WorksetTable Class
GetWorkset Overload
Autodesk.Revit.DB Namespace